package com.fxtv.framework.model;

/**
 * Created by wzh on 2015/12/31.
 */
public class HttpCode {
    //全局http请求code
    public static final int Signature_failure = 1001,//签名失败,
            NO_LOGIN = 1002,//用户没有登录,
            SUECCSS = 2000,//数据获取成功,
            NOT_MORE = 4000,//没有更多数据,
            ERROR = 1003,//请求参数错误,
            repetitive_operation = 1004,//不能重复操作,
            Frequent_operation = 1005,//不能频繁操作,
            disabled_user = 1006,//非法用户,
            Not_reached_grade = 1007,//未达到等级,
            Lack_of_biscuits = 1008,//饼干不足,
            Illegal_equipment = 1015//非法设备,


;

    public static final int NO_NETWORK=400;//无连接
/*
            //注册登录个人信息
            4101,//您因为违反用户协议被禁止登录,
            4102,//登录异常,
            4103,//用户名格式错误,
            4104,//用户名和密码不能为空,
            4105,//用户名或密码错误,
            4106,//用户名不存在,
            4107,//用户名已被注册,
            4108,//用户名长度为6-12个字符,
            4109,//密码不能为空,
            4110,//密码格式错误,
            4111,//密码长度为6-12个字符,
            4112,//密码不一致,
            4113,//验证码不能为空,
            4114,//验证码错误,
            4115,//昵称格式错误,
            4116,//昵称已被使用,
            4117,//每个用户只能修改一次昵称,
            4118,//手机号已被绑定,
            4119,//手机号格式错误,
            4120,//手机号未被绑定,
            4121,//手机号和密码不能为空,
            4122,//手机号已被注册,

            //用户操作
            4201,//每天的视频收藏数不能超过100个,
            4202,//视频收藏数不能超过100个,
            4203,//每天订阅的主播数不能超过100个,
            4204,//每天订阅的标签数不能超过500个,
            4205,//订阅主播数不能超过100个,
            4206,//订阅分类数不能超过100个,
            4207,//禁止该用户评论,
            4208,//反馈内容大于1000个字,
            4209,//评论内容大于300个字,
            4210,//回复评论内容大于300个字,
            4211,//不要频繁发送消息，请等待对方回复,
            4212,//弹幕内容大于200个字符,
            4213,//今天已经签到过了,
            4214,//回复动态内容大于300个字,
            4250,//关注话题不能超过100个,

            4301,//文件上传失败,
            4304,//尚未报名,
            4305,//重复报名,
            4306,//重复签到,*/
}
